# .zsh_plugins.txt - comments begin with "#"

# jeffreytse/zsh-vi-mode

# set up Zsh completions with plugins
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# handle OMZ dependencies
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:themes/robbyrussell.zsh-theme
ohmyzsh/ohmyzsh path:plugins/vi-mode

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search
